cask_args appdir: '/Applications'

tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'cocoapods'
brew 'codemod'
brew 'diff-so-fancy'
brew 'dnsmasq'
brew 'flake8'
brew 'fzf'
brew 'git'
brew 'go'
brew 'highlight'
brew 'htop'
brew 'hub'
brew 'ios-deploy'
brew 'lighttpd'
brew 'nmap'
brew 'python3'
brew 'rbenv'
brew 'rustup'
brew 'socat'
brew 'terminal-notifier'
brew 'tldr'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'zsh-completions'
brew 'zsh'

cask 'alfred'
cask 'blender'
cask 'caffeine'
cask 'dash'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'font-jetbrains-mono'
cask 'iterm2'
cask 'karabiner-elements'
cask 'ngrok'
cask 'quip'
cask 'rescuetime'
cask 'slate'
cask 'spotify'
cask 'sublime-text'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'

# QuickLook plugins
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'
